# Задача 2: Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |


number  =  int ( input ( "Введите трехзначное число: " ))
if  number / 100  >  9  and  number/ 100  ==  0 :
    print ( "Слишком мало цифр! Введите трёхзначное число" )
else :
    print ( f"Сумма цифр  введённого числа { int ( number / 100 ) +  int (( number % 100 ) / 10 ) +  int ( number % 10 ) } " )




# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали num журавликов.
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

# *Пример:*

# 6 -> 1  4  1
# 24 -> 4  16  4
#     60 -> 10  40  10


num = int(input("Сколько всего журавликов сделали дети?: "))

if num%6 != 0:
    print("Под условие задачи это не подойдёт...")
else:
    print(f"Петя сделал {int(num/6)}, и Серёжа тоже {int(num/6)}. Катя сделала {int(2*num/3)}")



# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером. 
# Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. 
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.

# *Пример:*

# 385916 -> yes
# 123456 -> no


ticket = int(input("Введите проверяемый билетик: "))
part1 = (int(ticket/1000)//100) + int((ticket/1000)//10%10) + int((ticket/1000)%10)
part2 = (int(ticket%1000)//100) + int((ticket%1000)//10%10) + int((ticket%1000)%10)

if ((ticket // 100000) == 0) and ((ticket // 100000) > 9):
    print("Это не наш билет! Вы пытаетесь проехать зайцем!")
else:
    if part1 == part2:
        print(f"Билетик счастливый!")
    else:
        print(f"Это обычный билетик!")



# Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек,
#  если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).

# *Пример:*

# 3 2 4 -> yes
# 3 2 1 -> no

m = int(input("Сколько долек в длинну?"))
n = int(input("А в ширину?"))
k = int(input("А сколько долек вы отломите?"))

if k % n == 0 and k // n <= m:
    print("Да!")
elif k % m == 0 and k // m <= n:
    print("Да")
else:
    print("НЕт")